#include "mosgortrans_util.h"

void from_days_to_datetime(uint16_t days, DateTime* datetime, uint16_t start_year) {
    uint32_t timestamp = days * 24 * 60 * 60;
    DateTime start_datetime = {0};
    start_datetime.year = start_year - 1;
    start_datetime.month = 12;
    start_datetime.day = 31;
    timestamp += datetime_datetime_to_timestamp(&start_datetime);
    datetime_timestamp_to_datetime(timestamp, datetime);
}

void from_minutes_to_datetime(uint32_t minutes, DateTime* datetime, uint16_t start_year) {
    uint32_t timestamp = minutes * 60;
    DateTime start_datetime = {0};
    start_datetime.year = start_year - 1;
    start_datetime.month = 12;
    start_datetime.day = 31;
    timestamp += datetime_datetime_to_timestamp(&start_datetime);
    datetime_timestamp_to_datetime(timestamp, datetime);
}

typedef struct {
    uint16_t view; //101
    uint16_t type; //102
    uint32_t number; //201
    uint8_t layout; //111
    uint8_t layout2; //112
    uint16_t use_before_date; //202
    uint16_t blank_type; //121
    uint32_t remaining_funds; //322
    uint32_t hash; //502
    uint16_t validator; //422
    uint32_t start_trip_minutes; //405
    uint8_t fare_trip; //441
    uint8_t minutes_pass; //412
    uint8_t transport_type_flag; //421.0
    uint8_t transport_type1; //421.1
    uint8_t transport_type2; //421.2
    uint8_t transport_type3; //421.3
    uint8_t transport_type4; //421.4
    uint8_t blocked; //303
    uint16_t type_of_extended; //122
    uint16_t valid_to_date; //311
    uint16_t activate_during; //302
    uint32_t valid_for_minutes; //314
    uint8_t transport_type; //421
    uint8_t passage_in_metro; //431
    uint8_t transfer_in_metro; //432
    uint16_t remaining_trips; //321
    uint32_t start_trip_neg_minutes; //404
    uint8_t requires_activation; //301
    uint8_t extended; //123
    uint16_t hash1; //501.1
} BlockData;

void parse_layout_2(BlockData* data_block, const MfClassicBlock* block) {
    data_block->view = bit_lib_get_bits_16(block->data, 0, 10);
    data_block->type = bit_lib_get_bits_16(block->data, 10, 10);
    data_block->number = bit_lib_get_bits_32(block->data, 20, 32);
    data_block->layout = bit_lib_get_bits(block->data, 52, 4);
    data_block->use_before_date = bit_lib_get_bits_16(block->data, 56, 16);
    data_block->validator = bit_lib_get_bits_16(block->data, 205, 16);
    data_block->blocked = bit_lib_get_bits(block->data, 128, 1);
}

void parse_layout_6(BlockData* data_block, const MfClassicBlock* block) {
    data_block->view = bit_lib_get_bits_16(block->data, 0, 10); //101
    data_block->type = bit_lib_get_bits_16(block->data, 10, 10); //102
    data_block->number = bit_lib_get_bits_32(block->data, 20, 32); //201
    data_block->layout = bit_lib_get_bits(block->data, 52, 4); //111
